# Создаем двумерный список с данными лабиринта
# От старта к финишу должен быть только 1 путь-дорожка из 0
a = []
# Лабиринт может быть любого размера
a.append([-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1])
a.append([-1,  0, -1, -0,  0,  0, -1,  0,  0,  0, -1])
a.append([-1,  0,  0,  0, -1,  0, -1,  0, -1,  0, -1])
a.append([-1,  0, -1,  0, -1,  0,  0,  0, -1,  0, -1])
a.append([-1,  0, -1,  0, -1, -1, -1, -1, -1,  0, -1])
a.append([-1,  0, -1,  0,  0,  0,  0,  0, -1,  0, -1])
a.append([-1,  0, -1, -1, -1, -1, -1, -1, -1,  0, -1])
a.append([-1,  0,  0,  0,  0,  0,  0,  0, -1, -1, -1])
a.append([-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1])


def printLab(a):
    '''
    Метод вывода "красивого" лабиринта на экран.
    '''
    # Перебираем список
    for i in a:
        for j in i:
            # Если элемент равен 0, то выводим 4 пробела
            if (j == 0):
                print('    ', end='')
            elif (j == -1):
                print('****', end='')
            else:
                # Добавление 0 перед числом для чисел меньше 10
                # Нужно для графической составляющей
                if (j < 10):
                    print(f' 0{j} ', end='')
                else:
                    print(f' {j} ', end='')
        print()
    print()

def findPath(a, x, y, number):
    '''
    Метод поиска пути, нумерация вместо 0 в списке a
    '''
    a[x][y] = number

    # Если есть путь ВВЕРХ, то нумеруем его
    if (a[x - 1][y] == 0):
        findPath(a, x - 1, y, number + 1)

    # Если есть путь ВНИЗ, то нумеруем его
    if (a[x + 1][y] == 0):
        findPath(a, x + 1, y, number + 1)

    # Если есть путь ВЛЕВО, то нумеруем его
    if (a[x][y - 1] == 0):
        findPath(a, x, y - 1, number + 1)

    # Если есть путь ВПРАВО, то нумеруем его
    if (a[x][y + 1] == 0):
        findPath(a, x, y + 1, number + 1)

def getRoad(a, x, y):
    '''
    Получаем координаты найденного пути
    '''
    # Список с координатами выигрышного пути
    res = []
    # Добавление настоящих координат в список
    res.append([x, y])
    # Если СВЕРХУ пронумеровано как в настоящей позиции, но (-1)
    if (a[x - 1][y] == a[x][y] - 1):
        # То добавим это к списку и пойдём дальше
        return res + getRoad(a, x - 1, y)
    # СНИЗУ
    if (a[x + 1][y] == a[x][y] - 1):
        return res + getRoad(a, x + 1, y)
    # СПРАВА
    if (a[x][y - 1] == a[x][y] - 1):
        return res + getRoad(a, x, y - 1)
    # СЛЕВА
    if (a[x][y + 1] == a[x][y] - 1):
        return res + getRoad(a, x, y + 1)

    return res

# ОСНОВНОЕ ТЕЛО ПРОГРАММЫ
print('До обработки:')
printLab(a)

# Ищем путь из точки с координатами 1, 1, начиная нумерацию с 1 в списке a
findPath(a, 1, 1, 1)

# Вывод списка с указывающими путь цифрами в клетках
print('После обработки:')
printLab(a)

# Хранение координат самого быстрого пути
road = getRoad(a, 6, 9)
road.reverse()

print('Координаты пути:')
count = 0
for i in road:
    count += 1
    if (count < 10):
        print(f'0{count}. {i}', end=' ')
    else:
        print(f'{count}. {i}', end=' ')
    if (count % 4 == 0):
        print()
